Repository: hoshiizumiya/OpenNet
Catalog: OpenNet/Strings/*/Resources.resw
Source language: en_us
Languages: fr, it, ja, ko, ru, zh_cn, zh_hant

# CommonContentBrowse.Content
source: Browse...
fr: Parcourir...
ja: 参照...
ru: Обзор...
zh_cn: 浏览...
zh_hant: 瀏覽...

source: Browse...
fr: Parcourir...
ja: 参照...
ru: Обзор...
zh_cn: 浏览...
zh_hant: 瀏覽...

# HttpDownloadDialogFileNameBox.Header
source: File name (optional)
fr: Nom du fichier (facultatif)
it: Nome file (facoltativo)
ja: ファイル名（任意）
ko: 파일 이름(선택 사항)
ru: Имя файла (необязательно)
zh_cn: 文件名（可选）
zh_hant: 檔案名稱（選填）

# HttpDownloadDialogFileNameBox.PlaceholderText
source: Leave empty to auto-detect
fr: Laisser vide pour la détection automatique
it: Lascia vuoto per il rilevamento automatico
ja: 自動検出する場合は空欄のままにしてください
ko: 자동 감지하려면 비워 두세요
ru: Оставьте пустым для автоопределения
zh_cn: 留空则自动检测
zh_hant: 留空以自動偵測

# HttpDownloadDialogUrlErrorInfoBar.Title
source: Invalid URL
fr: URL non valide
it: URL non valido
ja: 無効な URL
ko: 잘못된 URL
ru: Недопустимый URL
zh_cn: 无效的 URL
zh_hant: 無效的 URL

# HttpDownloadDialogUrlErrorInfoBar.Message
source: Please enter a valid HTTP, HTTPS, or FTP URL.
fr: Veuillez saisir une URL HTTP, HTTPS ou FTP valide.
it: Inserisci un URL HTTP, HTTPS o FTP valido.
ja: 有効な HTTP、HTTPS、または FTP URL を入力してください。
ko: 올바른 HTTP, HTTPS 또는 FTP URL을 입력하세요.
ru: Введите корректный URL HTTP, HTTPS или FTP.
zh_cn: 请输入有效的 HTTP、HTTPS 或 FTP 链接。
zh_hant: 請輸入有效的 HTTP、HTTPS 或 FTP URL。

# PeerHeader_Client.Text
source: Client
ja: クライアント
ko: 클라이언트
ru: Клиент
zh_cn: 客户端
zh_hant: 用戶端

# PeerHeader_Progress.Text
source: Progress
fr: Progression
it: Avanzamento
ja: 進行状況
ko: 진행률
ru: Прогресс
zh_cn: 进度
zh_hant: 進度

# PeerHeader_DLSpeed.Text
source: DL Speed
fr: Vitesse de téléchargement
it: Velocità DL
ja: DL 速度
ko: 다운로드 속도
ru: Скорость загрузки
zh_cn: 下载速度
zh_hant: 下載速度

# PeerHeader_ULSpeed.Text
source: UL Speed
fr: Vitesse de téléversement
it: Velocità UL
ja: UL 速度
ko: 업로드 속도
ru: Скорость отдачи
zh_cn: 上传速度
zh_hant: 上傳速度

# CommonTextDownloaded.Text
source: Downloaded
fr: Téléchargé
ja: ダウンロード済み
ru: Загружено
zh_cn: 已下载
zh_hant: 已下載

source: Downloaded
fr: Téléchargé
ja: ダウンロード済み
ru: Загружено
zh_cn: 已下载
zh_hant: 已下載

# PeerHeader_Uploaded.Text
source: Uploaded
zh_cn: 已上传
zh_hant: 已上傳

# PeerMenu_Location.Text
source: Location
zh_cn: 位置
zh_hant: 位置

# PeerMenu_Progress.Text
source: Progress
zh_cn: 进度
zh_hant: 進度

# PeerMenu_DLSpeed.Text
source: DL Speed
zh_cn: 下载速度
zh_hant: 下載速度

# PeerMenu_ULSpeed.Text
source: UL Speed
zh_cn: 上传速度
zh_hant: 上傳速度

# PeerMenu_Uploaded.Text
source: Uploaded
zh_cn: 已上传
zh_hant: 已上傳

# PeerMenu_Client.Text
source: Client
zh_cn: 客户端
zh_hant: 用戶端

# PeerMenu_Status.Text
source: Status
zh_cn: 状态
zh_hant: 狀態

# PeerMenu_Reason.Text
source: Reason
fr: Raison
it: Motivo
ja: 理由
ko: 이유
ru: Причина
zh_cn: 原因
zh_hant: 原因

# PeerMenu_Protocol.Text
source: Protocol
zh_cn: 协议
zh_hant: 協定

# PeerMenu_Initiator.Text
source: Initiator
zh_cn: 发起方
zh_hant: 發起方

# PeerMenu_Source.Text
source: Source
zh_cn: 来源
zh_hant: 來源

# PeersList_EmptyState.Text
source: No peers connected
fr: Aucun pair connecté
it: Nessun peer connesso
ja: 接続中のピアはありません
ko: 연결된 피어 없음
ru: Нет подключённых пиров
zh_cn: 当前无已连接节点
zh_hant: 沒有已連線的節點

# Task_TrackersList.Header
source: Trackers
fr: Traqueurs
it: Tracker
ja: トラッカー
ko: 트래커
ru: Трекеры
zh_cn: 追踪器
zh_hant: Tracker

# TrackerHeader_Tier.Text
source: Tier
fr: Niveau
it: Livello
ja: 階層
ko: 티어
ru: Уровень
zh_cn: 层级
zh_hant: 層級

# TrackerHeader_Peers.Text
source: Peers
fr: Pairs
it: Peer
ja: ピア
ko: 피어
ru: Пиры
zh_cn: 节点数
zh_hant: 節點

# TrackerHeader_Status.Text
source: Status
fr: État
it: Stato
ja: 状態
ko: 상태
ru: Состояние
zh_cn: 状态
zh_hant: 狀態

# TrackerHeader_Message.Text
source: Message
it: Messaggio
ja: メッセージ
ko: 메시지
ru: Сообщение
zh_cn: 消息
zh_hant: 訊息

# TrackersList_EmptyState.Text
source: No trackers
fr: Aucun traqueur
it: Nessun tracker
ja: トラッカーはありません
ko: 트래커 없음
ru: Нет трекеров
zh_cn: 暂无 Tracker 信息
zh_hant: 沒有 Tracker

# Task_FilesList.Header
source: Files
fr: Fichiers
it: File
ja: ファイル
ko: 파일
ru: Файлы
zh_cn: 文件
zh_hant: 檔案

# FileHeader_Path.Text
source: File
fr: Fichier
ja: ファイル
ko: 파일
ru: Файл
zh_cn: 文件
zh_hant: 檔案

# FileHeader_Size.Text
source: Size
fr: Taille
it: Dimensione
ja: サイズ
ko: 크기
ru: Размер
zh_cn: 大小
zh_hant: 大小

# FileHeader_Progress.Text
source: Progress
fr: Progression
it: Avanzamento
ja: 進行状況
ko: 진행률
ru: Прогресс
zh_cn: 进度
zh_hant: 進度

# FileHeader_Done.Text
source: Done
fr: Terminé
it: Completato
ja: 完了
ko: 완료
ru: Готово
zh_cn: 已完成
zh_hant: 完成

# FileHeader_Priority.Text
source: Priority
fr: Priorité
it: Priorità
ja: 優先度
ko: 우선순위
ru: Приоритет
zh_cn: 优先级
zh_hant: 優先順序

# FilesList_EmptyState.Text
source: No file information available
fr: Aucune information de fichier disponible
it: Nessuna informazione sui file disponibile
ja: ファイル情報はありません
ko: 사용 가능한 파일 정보가 없습니다
ru: Нет доступной информации о файлах
zh_cn: 暂无文件信息
zh_hant: 沒有可用的檔案資訊

# IPF_Title.Text
source: IP Filter
fr: Filtre IP
it: Filtro IP
ja: IP フィルター
ko: IP 필터
ru: IP-фильтр
zh_cn: IP 过滤器
zh_hant: IP 篩選器

# IPF_Subtitle.Text
source: Block or allow connections from specific IP addresses and ranges
fr: Bloquer ou autoriser les connexions provenant d’adresses et de plages IP spécifiques
it: Blocca o consenti connessioni da indirizzi IP e intervalli specifici
ja: 特定の IP アドレスや範囲からの接続をブロックまたは許可します
ko: 특정 IP 주소 및 범위의 연결을 차단하거나 허용합니다
ru: Блокировать или разрешать подключения с указанных IP-адресов и диапазонов
zh_cn: 阻止或允许来自特定 IP 地址和范围的连接
zh_hant: 封鎖或允許來自特定 IP 位址與範圍的連線

# IPF_Section_General.Text
source: General
fr: Général
it: Generale
ja: 一般
ko: 일반
ru: Общие
zh_cn: 常规
zh_hant: 一般

# IPF_Enable.Header
source: Enable IP Filter
fr: Activer le filtre IP
it: Abilita filtro IP
ja: IP フィルターを有効にする
ko: IP 필터 사용
ru: Включить IP-фильтр
zh_cn: 启用 IP 过滤器
zh_hant: 啟用 IP 篩選器

# IPF_Enable.Description
source: When enabled, connections from blocked IPs will be rejected
fr: Lorsque cette option est activée, les connexions provenant d’IP bloquées sont rejetées
it: Quando è abilitato, le connessioni dagli IP bloccati verranno rifiutate
ja: 有効にすると、ブロックされた IP からの接続は拒否されます
ko: 사용하면 차단된 IP의 연결을 거부합니다
ru: При включении подключения с заблокированных IP будут отклоняться
zh_cn: 启用后将拒绝来自被阻止 IP 的连接
zh_hant: 啟用時，來自被封鎖 IP 的連線將被拒絕

# IPF_RuleCount.Header
source: Total Rules
fr: Nombre total de règles
it: Regole totali
ja: ルール総数
ko: 전체 규칙
ru: Всего правил
zh_cn: 规则总数
zh_hant: 規則總數

# IPF_RuleCount.Description
source: Number of IP filter rules currently loaded
fr: Nombre de règles de filtrage IP actuellement chargées
it: Numero di regole del filtro IP attualmente caricate
ja: 現在読み込まれている IP フィルタールールの数
ko: 현재 로드된 IP 필터 규칙 수
ru: Число загруженных правил IP-фильтра
zh_cn: 当前已加载的 IP 过滤规则数量
zh_hant: 目前已載入的 IP 篩選規則數量

# IPF_Section_AddRule.Text
source: Add Rules
fr: Ajouter des règles
it: Aggiungi regole
ja: ルールを追加
ko: 규칙 추가
ru: Добавить правила
zh_cn: 添加规则
zh_hant: 新增規則

# IPF_ManualAdd.Header
source: Manual Input
fr: Saisie manuelle
it: Inserimento manuale
ja: 手動入力
ko: 직접 입력
ru: Ручной ввод
zh_cn: 手动输入
zh_hant: 手動輸入

# IPF_ManualAdd.Description
source: Enter IP addresses, CIDR blocks, or ranges (one per line)
fr: Saisissez des adresses IP, des blocs CIDR ou des plages (une par ligne)
it: Inserisci indirizzi IP, blocchi CIDR o intervalli (uno per riga)
ja: IP アドレス、CIDR ブロック、または範囲を入力（1 行につき 1 件）
ko: IP 주소, CIDR 블록 또는 범위를 한 줄에 하나씩 입력하세요
ru: Введите IP-адреса, блоки CIDR или диапазоны (по одному на строку)
zh_cn: 输入 IP 地址、CIDR 块或范围（每行一个）
zh_hant: 輸入 IP 位址、CIDR 區塊或範圍（每行一個）

# IPF_ManualInput.Header
source: IP Addresses
fr: Adresses IP
it: Indirizzi IP
ja: IP アドレス
ko: IP 주소
ru: IP-адреса
zh_cn: IP 地址
zh_hant: IP 位址

# IPF_AddBtn.Content
source: Add
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
ru: Добавить
zh_cn: 添加
zh_hant: 新增

# IPF_ImportFile.Header
source: Import from File
fr: Importer depuis un fichier
it: Importa da file
ja: ファイルからインポート
ko: 파일에서 가져오기
ru: Импортировать из файла
zh_cn: 从文件导入
zh_hant: 從檔案匯入

# IPF_ImportFile.Description
source: Import rules from a text file (.txt, .dat, .p2p)
fr: Importer des règles depuis un fichier texte (.txt, .dat, .p2p)
it: Importa regole da un file di testo (.txt, .dat, .p2p)
ja: テキストファイル（.txt、.dat、.p2p）からルールをインポートします
ko: 텍스트 파일(.txt, .dat, .p2p)에서 규칙을 가져옵니다
ru: Импортировать правила из текстового файла (.txt, .dat, .p2p)
zh_cn: 从文本文件（.txt、.dat、.p2p）导入规则
zh_hant: 從文字檔（.txt、.dat、.p2p）匯入規則

# IPF_Section_Manage.Text
source: Manage Rules
fr: Gérer les règles
it: Gestisci regole
ja: ルールを管理
ko: 규칙 관리
ru: Управление правилами
zh_cn: 管理规则
zh_hant: 管理規則

# IPF_ClearAll.Header
source: Clear All Rules
fr: Effacer toutes les règles
it: Cancella tutte le regole
ja: すべてのルールを消去
ko: 모든 규칙 지우기
ru: Очистить все правила
zh_cn: 清除所有规则
zh_hant: 清除所有規則

# IPF_ClearAll.Description
source: Remove all IP filter rules from the database
fr: Supprimer toutes les règles de filtrage IP de la base de données
it: Rimuovi tutte le regole del filtro IP dal database
ja: データベースからすべての IP フィルタールールを削除します
ko: 데이터베이스에서 모든 IP 필터 규칙을 제거합니다
ru: Удалить все правила IP-фильтра из базы данных
zh_cn: 从数据库中移除所有 IP 过滤规则
zh_hant: 從資料庫移除所有 IP 篩選規則

# IPF_ClearBtn.Content
source: Clear All
fr: Tout effacer
it: Cancella tutto
ja: すべて消去
ko: 모두 지우기
ru: Очистить всё
zh_cn: 全部清除
zh_hant: 全部清除

# IPF_RuleFiles.Header
source: Rule Files
fr: Fichiers de règles
it: File delle regole
ja: ルールファイル
ko: 규칙 파일
ru: Файлы правил
zh_cn: 规则文件
zh_hant: 規則檔案

# IPF_RuleFiles.Description
source: Open the editable copies in application data; import a file to add changes, or edit active database rules below
fr: Ouvrez les copies modifiables dans les données de l’application ; importez un fichier pour ajouter des modifications, ou modifiez ci-dessous les règles actives de la base de données.
it: Apri le copie modificabili nei dati dell'applicazione; importa un file per aggiungere modifiche oppure modifica qui sotto le regole attive del database
ja: アプリケーションデータ内の編集可能なコピーを開きます。変更を追加するにはファイルをインポートするか、下の有効なデータベースルールを編集してください
ko: 앱 데이터의 편집 가능한 사본을 엽니다. 파일을 가져와 변경 사항을 추가하거나 아래에서 활성 데이터베이스 규칙을 편집하세요
ru: Откройте редактируемые копии в данных приложения; импортируйте файл, чтобы добавить изменения, или измените активные правила базы данных ниже.
zh_cn: 打开应用数据中的可编辑副本；文件修改后可重新导入，当前生效规则可在下方直接编辑
zh_hant: 開啟應用程式資料中的可編輯副本；匯入檔案以新增變更，或在下方編輯作用中的資料庫規則

# IPF_OpenFolderBtn.Content
source: Open Folder
fr: Ouvrir le dossier
it: Apri cartella
ja: フォルダーを開く
ko: 폴더 열기
ru: Открыть папку
zh_cn: 打开目录
zh_hant: 開啟資料夾

# IPF_OpenPrimaryFileBtn.Content
source: Edit ipfilter.txt
fr: Modifier ipfilter.txt
it: Modifica ipfilter.txt
ja: ipfilter.txt を編集
ko: ipfilter.txt 편집
ru: Изменить ipfilter.txt
zh_cn: 编辑 ipfilter.txt
zh_hant: 編輯 ipfilter.txt

# IPF_OpenSecondaryFileBtn.Content
source: Edit ipfilter2.txt
fr: Modifier ipfilter2.txt
it: Modifica ipfilter2.txt
ja: ipfilter2.txt を編集
ko: ipfilter2.txt 편집
ru: Изменить ipfilter2.txt
zh_cn: 编辑 ipfilter2.txt
zh_hant: 編輯 ipfilter2.txt

# IPF_RuleEditor.Header
source: Edit Stored Rules
fr: Modifier les règles enregistrées
it: Modifica regole salvate
ja: 保存済みルールを編集
ko: 저장된 규칙 편집
ru: Изменить сохранённые правила
zh_cn: 编辑已存储规则
zh_hant: 編輯已儲存的規則

# IPF_RuleEditor.Description
source: Search, edit, or delete active database rules; changes are applied to libtorrent immediately
fr: Rechercher, modifier ou supprimer les règles actives de la base de données ; les modifications sont appliquées immédiatement à libtorrent.
it: Cerca, modifica o elimina le regole attive del database; le modifiche vengono applicate immediatamente a libtorrent
ja: 有効なデータベースルールを検索、編集、または削除します。変更は直ちに libtorrent に適用されます
ko: 활성 데이터베이스 규칙을 검색, 편집 또는 삭제합니다. 변경 사항은 libtorrent에 즉시 적용됩니다
ru: Ищите, изменяйте или удаляйте активные правила базы данных; изменения немедленно применяются к libtorrent.
zh_cn: 搜索、编辑或删除当前生效的数据库规则，修改会立即应用到 libtorrent
zh_hant: 搜尋、編輯或刪除作用中的資料庫規則；變更會立即套用至 libtorrent

# IPF_RefreshRulesBtn.Content
source: Refresh
fr: Actualiser
it: Aggiorna
ja: 更新
ko: 새로 고침
ru: Обновить
zh_cn: 刷新
zh_hant: 重新整理

# IPF_RuleSearch.PlaceholderText
source: Search by IP, range, description, or rule ID
fr: Rechercher par IP, plage, description ou ID de règle
it: Cerca per IP, intervallo, descrizione o ID regola
ja: IP、範囲、説明、またはルール ID で検索
ko: IP, 범위, 설명 또는 규칙 ID로 검색
ru: Поиск по IP, диапазону, описанию или ID правила
zh_cn: 按 IP、范围、描述或规则 ID 搜索
zh_hant: 依 IP、範圍、說明或規則 ID 搜尋

# IPF_EditRuleBtn.Content
source: Edit
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
ru: Изменить
zh_cn: 编辑
zh_hant: 編輯

# IPF_DeleteRuleBtn.Content
source: Delete
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
ru: Удалить
zh_cn: 删除
zh_hant: 刪除

# IPF_Section_Subscriptions.Text
source: Subscriptions
fr: Abonnements
it: Sottoscrizioni
ja: 購読
ko: 구독
ru: Подписки
zh_cn: 订阅
zh_hant: 訂閱

# IPF_Subscriptions.Header
source: IP filter subscriptions
fr: Abonnements aux filtres IP
it: Sottoscrizioni filtro IP
ja: IP フィルター購読
ko: IP 필터 구독
ru: Подписки IP-фильтра
zh_cn: IP 过滤列表订阅
zh_hant: IP 篩選器訂閱

# IPF_Subscriptions.Description
source: Download and maintain IP rules from HTTP or HTTPS sources
fr: Télécharger et maintenir les règles IP depuis des sources HTTP ou HTTPS
it: Scarica e mantieni le regole IP da sorgenti HTTP o HTTPS
ja: HTTP または HTTPS ソースから IP ルールをダウンロードして維持します
ko: HTTP 또는 HTTPS 소스에서 IP 규칙을 다운로드하고 유지합니다
ru: Загружать и обновлять IP-правила из источников HTTP или HTTPS
zh_cn: 从 HTTP 或 HTTPS 来源下载并维护 IP 过滤规则
zh_hant: 從 HTTP 或 HTTPS 來源下載並維護 IP 規則

# IPF_UpdateSubscriptionsNow.Content
source: Update now
fr: Mettre à jour maintenant
it: Aggiorna ora
ja: 今すぐ更新
ko: 지금 업데이트
ru: Обновить сейчас
zh_cn: 立即更新
zh_hant: 立即更新

# IPF_SubscriptionAutoUpdate.Header
source: Automatic updates
fr: Mises à jour automatiques
it: Aggiornamenti automatici
ja: 自動更新
ko: 자동 업데이트
ru: Автоматические обновления
zh_cn: 自动更新
zh_hant: 自動更新

# IPF_SubscriptionAutoUpdate.Description
source: Check enabled sources in the background at the configured interval
fr: Vérifier en arrière-plan les sources activées selon l’intervalle configuré
it: Controlla in background le sorgenti abilitate all'intervallo configurato
ja: 設定した間隔で有効なソースをバックグラウンド確認します
ko: 설정된 간격으로 백그라운드에서 사용 중인 소스를 확인합니다
ru: Проверять включённые источники в фоне с заданным интервалом
zh_cn: 按照设定间隔在后台检查已启用的订阅源
zh_hant: 依設定的間隔在背景檢查已啟用的來源

# IPF_SubscriptionAdd.Header
source: Add source
fr: Ajouter une source
it: Aggiungi sorgente
ja: ソースを追加
ko: 소스 추가
ru: Добавить источник
zh_cn: 添加订阅源
zh_hant: 新增來源

# IPF_SubscriptionAdd.Description
source: Enter a direct link to a plain-text IP filter list
fr: Saisissez un lien direct vers une liste de filtrage IP en texte brut
it: Inserisci un link diretto a un elenco di filtri IP in testo semplice
ja: プレーンテキストの IP フィルター一覧への直接リンクを入力
ko: 일반 텍스트 IP 필터 목록의 직접 링크를 입력하세요
ru: Введите прямую ссылку на текстовый список IP-фильтра
zh_cn: 输入纯文本 IP 过滤列表的直接链接
zh_hant: 輸入純文字 IP 篩選清單的直接連結

# IPF_AddSubscription.Content
source: Add
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
ru: Добавить
zh_cn: 添加
zh_hant: 新增

# IPF_SubscriptionSources.Header
source: Subscribed sources
fr: Sources abonnées
it: Sorgenti sottoscritte
ja: 購読中のソース
ko: 구독한 소스
ru: Источники подписок
zh_cn: 已订阅的来源
zh_hant: 已訂閱的來源

# IPF_SubscriptionSources.Description
source: Enabled state and the latest result are shown for each source
fr: L’état d’activation et le dernier résultat sont affichés pour chaque source
it: Per ogni sorgente vengono mostrati lo stato di abilitazione e l'ultimo risultato
ja: 各ソースの有効状態と最新結果が表示されます
ko: 각 소스의 사용 상태와 최신 결과를 표시합니다
ru: Для каждого источника отображаются состояние и последний результат
zh_cn: 显示每个来源的启用状态和最近更新结果
zh_hant: 每個來源都會顯示啟用狀態與最新結果

# IPF_EditSubscription.Content
source: Edit
fr: Modifier
it: Modifica
ja: 編集
ko: 편집
ru: Изменить
zh_cn: 编辑
zh_hant: 編輯

# IPF_DeleteSubscription.Content
source: Delete
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
ru: Удалить
zh_cn: 删除
zh_hant: 刪除

# IPF_SubscriptionMode.Header
source: Update behavior
fr: Comportement de mise à jour
it: Comportamento aggiornamento
ja: 更新動作
ko: 업데이트 동작
ru: Режим обновления
zh_cn: 更新方式
zh_hant: 更新行為

# IPF_SubscriptionMode.Description
source: Choose how downloaded rules are applied to the current database
fr: Choisissez comment les règles téléchargées sont appliquées à la base de données actuelle
it: Scegli come applicare le regole scaricate al database corrente
ja: ダウンロードしたルールを現在のデータベースへ適用する方法を選択します
ko: 다운로드한 규칙을 현재 데이터베이스에 적용하는 방법을 선택합니다
ru: Выберите, как загруженные правила применяются к текущей базе данных
zh_cn: 选择下载的规则如何应用到当前数据库
zh_hant: 選擇下載的規則如何套用至目前資料庫

# IPF_SubscriptionMerge.Content
source: Merge into existing IP address list
fr: Fusionner avec la liste d’adresses IP existante
it: Unisci all'elenco di indirizzi IP esistente
ja: 既存の IP アドレス一覧にマージ
ko: 기존 IP 주소 목록에 병합
ru: Объединить с существующим списком IP-адресов
zh_cn: 合并到现有 IP 地址列表
zh_hant: 合併至現有 IP 位址清單

# IPF_SubscriptionReplace.Content
source: Replace existing IP address list
fr: Remplacer la liste d’adresses IP existante
it: Sostituisci l'elenco di indirizzi IP esistente
ja: 既存の IP アドレス一覧を置き換え
ko: 기존 IP 주소 목록 교체
ru: Заменить существующий список IP-адресов
zh_cn: 替换现有 IP 地址列表
zh_hant: 取代現有 IP 位址清單

# IPF_SubscriptionInterval.Header
source: Update interval (hours)
fr: Intervalle de mise à jour (heures)
it: Intervallo di aggiornamento (ore)
ja: 更新間隔（時間）
ko: 업데이트 간격(시간)
ru: Интервал обновления (часы)
zh_cn: 更新间隔（小时）
zh_hant: 更新間隔（小時）

# IPF_SubscriptionInterval.Description
source: Allowed range: 1–168 hours
fr: Plage autorisée : 1–168 heures
it: Intervallo consentito: 1–168 ore
ja: 許容範囲: 1～168 時間
ko: 허용 범위: 1–168시간
ru: Допустимый диапазон: 1–168 часов
zh_cn: 允许范围：1–168 小时
zh_hant: 允許範圍：1–168 小時

# IPF_SubscriptionLastResult.Header
source: Last update result
fr: Résultat de la dernière mise à jour
it: Risultato ultimo aggiornamento
ja: 前回の更新結果
ko: 마지막 업데이트 결과
ru: Результат последнего обновления
zh_cn: 最近更新结果
zh_hant: 上次更新結果

# IPF_SubscriptionLastResult.Description
source: The latest automatic or manual subscription update
fr: Dernière mise à jour automatique ou manuelle de l’abonnement
it: L'ultimo aggiornamento automatico o manuale della sottoscrizione
ja: 最新の自動または手動購読更新
ko: 최근 자동 또는 수동 구독 업데이트
ru: Последнее автоматическое или ручное обновление подписки
zh_cn: 最近一次自动或手动订阅更新
zh_hant: 最近一次自動或手動訂閱更新

# IPF_Never
source: Never
fr: Jamais
it: Mai
ja: なし
ko: 안 함
ru: Никогда
zh_cn: 从未
zh_hant: 從不

# IPF_NeverUpdated
source: Not updated yet
fr: Pas encore mis à jour
it: Non ancora aggiornato
ja: まだ更新されていません
ko: 아직 업데이트되지 않음
ru: Ещё не обновлялось
zh_cn: 尚未更新
zh_hant: 尚未更新

# IPF_SourceSuccess
source: Success
fr: Réussite
it: Operazione riuscita
ja: 成功
ko: 성공
ru: Успешно
zh_cn: 成功
zh_hant: 成功

# IPF_SourceFailed
source: Failed
fr: Échec
it: Non riuscito
ja: 失敗
ko: 실패
ru: Ошибка
zh_cn: 失败
zh_hant: 失敗

# IPF_Rules
source: rules
fr: règles
it: regole
ja: ルール
ko: 규칙
ru: правил
zh_cn: 条规则
zh_hant: 條規則

# IPF_NotifyTitle
source: IP filter subscriptions
fr: Abonnements aux filtres IP
it: Sottoscrizioni filtro IP
ja: IP フィルター購読
ko: IP 필터 구독
ru: Подписки IP-фильтра
zh_cn: IP 过滤列表订阅
zh_hant: IP 篩選器訂閱

# IPF_NoEnabledSubscriptions
source: No enabled subscription sources
fr: Aucune source d’abonnement activée
it: Nessuna sorgente di sottoscrizione abilitata
ja: 有効な購読ソースがありません
ko: 사용 중인 구독 소스가 없습니다.
ru: Нет включённых источников подписки.
zh_cn: 没有已启用的订阅源
zh_hant: 沒有已啟用的訂閱來源

# IPF_UpdateSummarySuccess
source: Updated sources
fr: Sources mises à jour
it: Sorgenti aggiornate
ja: 更新済みソース
ko: 업데이트된 소스
ru: Обновлено источников
zh_cn: 已更新来源
zh_hant: 已更新來源

# IPF_UpdateSummaryRules
source: valid rules
fr: règles valides
it: regole valide
ja: 有効なルール
ko: 유효한 규칙
ru: корректных правил
zh_cn: 有效规则
zh_hant: 有效規則

# IPF_UpdateSummaryImported
source: database changes
fr: modifications de la base de données
it: modifiche al database
ja: データベース変更
ko: 데이터베이스 변경 사항
ru: изменений базы данных
zh_cn: 数据库变更
zh_hant: 資料庫變更

# IPF_UpdateSummaryFailed
source: failed
fr: échec
it: non riuscito
ja: 失敗
ko: 실패
ru: ошибок
zh_cn: 失败
zh_hant: 失敗

# IPF_UpdateAllFailed
source: All subscription updates failed.
fr: Toutes les mises à jour des abonnements ont échoué.
it: Tutti gli aggiornamenti delle sottoscrizioni non sono riusciti.
ja: すべての購読更新に失敗しました。
ko: 모든 구독 업데이트에 실패했습니다.
ru: Не удалось обновить ни одну подписку.
zh_cn: 所有订阅源均更新失败。
zh_hant: 所有訂閱更新皆失敗。

# IPF_UpdateUnexpectedError
source: The subscription update failed unexpectedly.
fr: La mise à jour de l’abonnement a échoué de manière inattendue.
it: L'aggiornamento della sottoscrizione non è riuscito in modo imprevisto.
ja: 購読の更新中に予期しないエラーが発生しました。
ko: 구독 업데이트 중 예기치 않은 오류가 발생했습니다.
ru: Во время обновления подписки произошла непредвиденная ошибка.
zh_cn: 订阅更新遇到意外错误。
zh_hant: 訂閱更新發生未預期的失敗。

# IPF_InvalidSubscriptionUrl
source: Enter a valid HTTP or HTTPS URL.
fr: Saisissez une URL HTTP ou HTTPS valide.
it: Inserisci un URL HTTP o HTTPS valido.
ja: 有効な HTTP または HTTPS URL を入力してください。
ko: 올바른 HTTP 또는 HTTPS URL을 입력하세요.
ru: Введите корректный URL HTTP или HTTPS.
zh_cn: 请输入有效的 HTTP 或 HTTPS 地址。
zh_hant: 請輸入有效的 HTTP 或 HTTPS URL。

# IPF_DuplicateSubscription
source: This subscription already exists.
fr: Cet abonnement existe déjà.
it: Questa sottoscrizione esiste già.
ja: この購読はすでに存在します。
ko: 이 구독은 이미 존재합니다.
ru: Эта подписка уже существует.
zh_cn: 该订阅源已存在。
zh_hant: 此訂閱已存在。

# IPF_SubscriptionAdded
source: Subscription sources added
fr: Sources d’abonnement ajoutées
it: Sorgenti di sottoscrizione aggiunte
ja: 購読ソースを追加しました
ko: 구독 소스가 추가되었습니다
ru: Источники подписки добавлены
zh_cn: 已添加订阅源
zh_hant: 已新增訂閱來源

# IPF_InvalidOrDuplicateSubscriptions
source: No new valid subscription URLs were found.
fr: Aucune nouvelle URL d’abonnement valide n’a été trouvée.
it: Non sono stati trovati nuovi URL di sottoscrizione validi.
ja: 新しい有効な購読 URL が見つかりませんでした。
ko: 새로운 유효한 구독 URL을 찾지 못했습니다.
ru: Новых корректных URL подписок не найдено.
zh_cn: 未找到新的有效订阅地址。
zh_hant: 找不到新的有效訂閱 URL。

# IPF_SourceEnabled
source: Enable this source
fr: Activer cette source
it: Abilita questa sorgente
ja: このソースを有効にする
ko: 이 소스 사용
ru: Включить этот источник
zh_cn: 启用此订阅源
zh_hant: 啟用此來源

# IPF_EditSubscriptionTitle
source: Edit subscription
fr: Modifier l’abonnement
it: Modifica sottoscrizione
ja: 購読を編集
ko: 구독 편집
ru: Изменить подписку
zh_cn: 编辑订阅源
zh_hant: 編輯訂閱

# IPF_Save
source: Save
fr: Enregistrer
it: Salva
ja: 保存
ko: 저장
ru: Сохранить
zh_cn: 保存
zh_hant: 儲存

# IPF_Cancel
source: Cancel
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
ru: Отмена
zh_cn: 取消
zh_hant: 取消

# IPF_SubscriptionUpdateFailed
source: The subscription could not be saved.
fr: L’abonnement n’a pas pu être enregistré.
it: Impossibile salvare la sottoscrizione.
ja: 購読を保存できませんでした。
ko: 구독을 저장할 수 없습니다.
ru: Не удалось сохранить подписку.
zh_cn: 无法保存该订阅源。
zh_hant: 無法儲存此訂閱。

# IPF_DeleteSubscriptionTitle
source: Delete subscription
fr: Supprimer l’abonnement
it: Elimina sottoscrizione
ja: 購読を削除
ko: 구독 삭제
ru: Удалить подписку
zh_cn: 删除订阅源
zh_hant: 刪除訂閱

# IPF_Delete
source: Delete
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
ru: Удалить
zh_cn: 删除
zh_hant: 刪除

# RenameTaskMenuItem.Text
source: Rename
fr: Renommer
it: Rinomina
ja: 名前を変更
ko: 이름 바꾸기
ru: Переименовать
zh_cn: 重命名
zh_hant: 重新命名

# BanPeer1hItem.Text
source: Ban for 1 hour
fr: Bannir pendant 1 heure
it: Blocca per 1 ora
ja: 1 時間ブロック
ko: 1시간 차단
ru: Заблокировать на 1 час
zh_cn: 封禁 1 小时
zh_hant: 封鎖 1 小時

# BanPeer24hItem.Text
source: Ban for 24 hours
fr: Bannir pendant 24 heures
it: Blocca per 24 ore
ja: 24 時間ブロック
ko: 24시간 차단
ru: Заблокировать на 24 часа
zh_cn: 封禁 24 小时
zh_hant: 封鎖 24 小時

# BanPeerPermanentItem.Text
source: Ban permanently
fr: Bannir définitivement
it: Blocca permanentemente
ja: 永久にブロック
ko: 영구 차단
ru: Заблокировать навсегда
zh_cn: 永久封禁
zh_hant: 永久封鎖

# UnbanPeerItem.Text
source: Remove manual IP ban
fr: Supprimer le bannissement IP manuel
it: Rimuovi blocco IP manuale
ja: 手動 IP ブロックを解除
ko: 수동 IP 차단 해제
ru: Снять ручную блокировку IP
zh_cn: 解除手动 IP 封禁
zh_hant: 移除手動 IP 封鎖

# PeerHeader_Location.Text
source: Location
fr: Emplacement
it: Posizione
ja: 場所
ko: 위치
ru: Расположение
zh_cn: 位置
zh_hant: 位置
